/*
 * To change this template, choose Tools | Templates
 * and open the template in the editor.
 */
package Polymorephism;

/**
 *
 * @author rm
 */
public class Informetion {
   
    public static void main (String[]args){
    
    System.out.print("vidio 52 ,51");
    /*
      
     * Polymorephism : تعدد الاشكال
      
      
     * Override : يعني بعدل في الصافت الموروسه يعني كسر الوراثة في ميثود معينة 
                  update inherited Method
                   
    Remember Override occare in inheritance by 1:update in method
                                               2:absract method
              
      حيث باخد الميثود من السوبر كلاس واحطها كما هي في الساب كلاس 
      
      واعدل فيها لكن بشرط التعديل يتم فقط على  method body
               
                
                
               * 1:  ولكن لا اعدل في عد البراميترز                              
               حيث لنقلها كما هي دون تعديل فييها خلاص لكن كما قلت التعديل فقط في 
               
               جواها فقط
               
               * 2:   ولاحظ ان access modifir  ثابت ومطاابق حيث لا اغبره 
               
               
               * 3:
          كذالك لا  اغير return value                                         
    فاذا كانت ترجع  استرينج فانها عند نقلها فترجع ايضا استرينج           
                                                
                                                
    
    * Overlod :بكريت او بصمم ميثود معينة باكتر من شكل علشان تتوافق مع شغلي واحتياجاتي فقد يوجد عندي ميثود واحده باكتر من اسم لكن باشكال كتير
    
              :   Occure in method and constractor
      
      
        بغير عدد البراميترز ()args()      
         
         
         
     
     
     
    */
    
    
    
    
    
    /*
      class as apramiter :   Ssuperclass man ولها باراميتر من نوع كلاس اسمه   ClassAsaPramiter  بعمل ميثود في كلاس  
      
      وباخل تلك الميثود احدد الميثود المعينة اللي عاو انفزها من الكلاس اللي انا استخدمتو كبراميتر     
       
وبعد كده اروح المين ميثود واستدعي الكلاس اللي انا عاوز انفذ ما داخله وهو الكلاس الذي يحتويClassAsaPramiter ع الميثود اللي مستخدم فيها براميتر من نوع كلاس       
      
       واخد اوبجكت واجد انه بداخله ميثود تحتاج براميتر من نوع كلاس  ويتم وضح الكلاس هنا كبراميتر عن طريق اخذ اوبجكت من هذا الكلاس ووضعه مكان الببراميتر
       
       * هنا بعمل الاوبجكت من الاكلاس محل الكلاس ويكون الاوبجكت من الكلاس براميتر
       * 
       * وكذالك يمكن وضع مكان البران البراميتر اي كلاس وارث من الكلاث اللي انا مستخدموه كبراميتر
       
       
     */
    
}
}